publish/emacs-ocaml-lsp.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-03-04 Mon 15:44 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Emacs configuration for merlin-lsp, the OCaml LSP server</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Louis Roché">
<meta name="description" content="How to configure lsp-mode in emacs to use the OCaml merlin-lsp server"
>
<meta name="keywords" content="lsp,ocaml,merlin,emacs,lsp-mode">
<link rel="stylesheet" href="/org.css" type="text/css"></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="archive.html"> HOME </a>
</div><div id="content">
<header>
<h1 class="title">Emacs configuration for merlin-lsp, the OCaml LSP server</h1>
</header><p>
Since the <span class="timestamp-wrapper"><span class="timestamp">[2019-01-28 Mon]</span></span>, there is an implementation of LSP server
<a href="https://github.com/ocaml/merlin/pull/905">integrated into merlin</a>. It's not the first LSP server for OCaml. There
are at least two other servers that exist. But having one officially
integrated in merlin provides a few guaranties.
</p>

<p>
I built an extension to merlin, <a href="https://github.com/Khady/merlin-eldoc">merlin-eldoc</a>, that provides some
facilities on top of what comes in the default merlin. Especially
highlighting all the occurrences of a value, jumping between the
occurrences, and automatically display its type. Using merlin-lsp, it
should be possible to have all those nice features plus the original
ones from merlin with very little configuration.
</p>

<p>
Emacs has two LSP clients. Here I will describe how to configure
<a href="https://github.com/emacs-lsp/lsp-mode">lsp-mode</a>, which in my experience works better than <a href="https://github.com/joaotavora/eglot">eglot</a>.
</p>

<p>
Note that <a href="https://github.com/emacs-lsp-legacy/lsp-ocaml">lsp-ocaml</a>, a configuration module for lsp-mode, is a
deprecated project. Now lsp-mode is enough.
</p>

<p>
First step is to install merlin-lsp. There is no package published on
opam yet. So it has to be pinned.
</p>

<div class="org-src-container">
<pre class="src src-bash">opam pin add merlin-lsp.dev https://github.com/ocaml/merlin.git
</pre>
</div>

<p>
Then comes the Emacs part. lsp-mode can be installed from melpa. And
works with emacs25+. The basic configuration to get to a working point
is short.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> '<span class="org-constant">lsp-mode</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>lsp-register-client
   <span class="org-rainbow-delimiters-depth-2">(</span>make-lsp-client
    <span class="org-builtin">:new-connection</span> <span class="org-rainbow-delimiters-depth-3">(</span>lsp-stdio-connection
                     '<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">"opam"</span> <span class="org-string">"exec"</span> <span class="org-string">"--"</span> <span class="org-string">"ocamlmerlin-lsp"</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-builtin">:major-modes</span> '<span class="org-rainbow-delimiters-depth-3">(</span>caml-mode tuareg-mode<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-builtin">:server-id</span> 'ocamlmerlin-lsp<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
With those lines in your Emacs configuration, you must now have the
<code>lsp</code> command available. If you visit an OCaml file and run it, it
will try to connect to the server.
</p>

<p>
During the connection to merlin-lsp, it should create a buffer name
<code>*lsp-log*</code>. Its content in case of successful connection looks like
this:
</p>

<div class="org-src-container">
<pre class="src src-text">Command "ocaml-language-server --stdio" is not present on the path.
Command "opam exec -- ocamlmerlin-lsp" is present on the path.
Found the following clients for /home/louis/Code/demo/src/main.ml: (server-id ocamlmerlin-lsp, priority 0)
The following clients were selected based on priority: (server-id ocamlmerlin-lsp, priority 0)
</pre>
</div>

<p>
Normally, lsp-mode should have configured <code>xref</code> automatically and the
most important features of merlin should already be available.
</p>

<ul class="org-ul">
<li>Jumping from a value to its definition, using <code>M-.</code> or
<code>xref-find-definitions</code> or <code>lsp-find-definition</code> (the equivalent of
<code>merlin-locate</code>).</li>
<li>Listing the occurrences of a value, with <code>M.?</code> or
<code>xref-find-references</code> or <code>lsp-find-references</code> (the equivalent of
<code>merlin-occurrences</code>).</li>
<li>Displaying the type of the value at point, with a message in the
minibuffer (relying on eldoc) or by calling
<code>lsp-describe-thing-at-point</code> (the equivalent of
<code>merlin-type-enclosing</code>).</li>
<li>Listing the errors in the current file, with flycheck or flymake.</li>
<li>Completion of variable and function names.</li>
</ul>

<p>
This list is not exhaustive. It even has features that are not
available with the usual merlin. <code>lsp-goto-type-definition</code> is like
locate, but for the type of the expression. <code>lsp-lens-show</code> is the
equivalent of the code lens in vscode.
</p>

<p>
Some extensions to lsp-mode are available, to have a fancier display
or nicer completion.
</p>

<ul class="org-ul">
<li><a href="https://github.com/tigersoldier/company-lsp">company-lsp</a></li>
<li><a href="https://github.com/emacs-lsp/lsp-ui">lsp-ui</a></li>
<li><a href="https://github.com/yyoncho/helm-lsp/">helm-lsp</a></li>
</ul>

<p>
There are a few things in the default configuration of lsp-mode that I
don't like. Especially, it tries to display the type at point even
when the point is not on some code. So I came up with a few changes,
mostly imported from merlin-eldoc. I am publishing here my whole
configuration, relying on <code>use-package</code>. I hope it can help you to
start using merlin-lsp.
</p>

<p>
Don't hesitate to give a hand to implement missing features in
merlin-lsp! It is usually not as hard as you imagine.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">my/merlin-lsp--current-font-among-fonts-p</span> <span class="org-rainbow-delimiters-depth-2">(</span>pos fonts<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"If current font at POS is among FONTS."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">let*</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span>fontfaces <span class="org-rainbow-delimiters-depth-5">(</span>get-text-property pos 'face<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-4">(</span>not <span class="org-rainbow-delimiters-depth-5">(</span>listp fontfaces<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">setf</span> fontfaces <span class="org-rainbow-delimiters-depth-5">(</span>list fontfaces<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>delq nil
          <span class="org-rainbow-delimiters-depth-4">(</span>mapcar <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-6">(</span>f<span class="org-rainbow-delimiters-depth-6">)</span>
                    <span class="org-rainbow-delimiters-depth-6">(</span>member f fonts<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span>
                  fontfaces<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">my/merlin-lsp--in-comment-p</span> <span class="org-rainbow-delimiters-depth-2">(</span>pos<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Return non-nil if character at POS is comment or documentation.</span>
<span class="org-doc">This is done by comparing font face.  So a mode such as</span>
<span class="org-doc">`</span><span class="org-doc"><span class="org-constant">tuareg-mode</span></span><span class="org-doc">' or `</span><span class="org-doc"><span class="org-constant">reason-mode</span></span><span class="org-doc">' must be activated in the buffer</span>
<span class="org-doc">before to call this function."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>my/merlin-lsp--current-font-among-fonts-p pos '<span class="org-rainbow-delimiters-depth-3">(</span>font-lock-comment-face
                                                   font-lock-comment-delimiter-face
                                                   font-lock-doc-face<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">my/merlin-lsp--in-string-p</span> <span class="org-rainbow-delimiters-depth-2">(</span>pos<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Return non-nil if character at POS is string.</span>
<span class="org-doc">This is done by comparing font face.  So a mode such as</span>
<span class="org-doc">`</span><span class="org-doc"><span class="org-constant">tuareg-mode</span></span><span class="org-doc">' or `</span><span class="org-doc"><span class="org-constant">reason-mode</span></span><span class="org-doc">' must be activated in the buffer</span>
<span class="org-doc">before to call this function."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>my/merlin-lsp--current-font-among-fonts-p pos '<span class="org-rainbow-delimiters-depth-3">(</span>font-lock-string-face<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">my/merlin-lsp--in-keyword-p</span> <span class="org-rainbow-delimiters-depth-2">(</span>pos<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Return non-nil if character at POS is keyword.</span>
<span class="org-doc">This is done by comparing font face.  So a mode such as</span>
<span class="org-doc">`</span><span class="org-doc"><span class="org-constant">tuareg-mode</span></span><span class="org-doc">' or `</span><span class="org-doc"><span class="org-constant">reason-mode</span></span><span class="org-doc">' must be activated in the buffer</span>
<span class="org-doc">before to call this function."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>my/merlin-lsp--current-font-among-fonts-p pos '<span class="org-rainbow-delimiters-depth-3">(</span>tuareg-font-lock-governing-face
                                                   font-lock-keyword-face<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">my/merlin-lsp--in-operator-p</span> <span class="org-rainbow-delimiters-depth-2">(</span>pos<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Return non-nil if character at POS is operator.</span>
<span class="org-doc">This is done by comparing font face.  So a mode such as</span>
<span class="org-doc">`</span><span class="org-doc"><span class="org-constant">tuareg-mode</span></span><span class="org-doc">' or `</span><span class="org-doc"><span class="org-constant">reason-mode</span></span><span class="org-doc">' must be activated in the buffer</span>
<span class="org-doc">before to call this function."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>my/merlin-lsp--current-font-among-fonts-p pos '<span class="org-rainbow-delimiters-depth-3">(</span>tuareg-font-lock-operator-face<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">my/merlin-lsp--valid-type-position-p</span> <span class="org-rainbow-delimiters-depth-2">(</span>pos<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Return non-nil if POS is in a place valid to get a type."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span>symbol <span class="org-rainbow-delimiters-depth-5">(</span>thing-at-point 'symbol<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>operator <span class="org-rainbow-delimiters-depth-5">(</span>my/merlin-lsp--in-operator-p pos<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>string <span class="org-rainbow-delimiters-depth-5">(</span>my/merlin-lsp--in-string-p pos<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>comment <span class="org-rainbow-delimiters-depth-5">(</span>my/merlin-lsp--in-comment-p pos<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>keyword <span class="org-rainbow-delimiters-depth-5">(</span>my/merlin-lsp--in-keyword-p pos<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">and</span> <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">or</span> symbol operator string<span class="org-rainbow-delimiters-depth-4">)</span>
         <span class="org-rainbow-delimiters-depth-4">(</span>not comment<span class="org-rainbow-delimiters-depth-4">)</span>
         <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">or</span> <span class="org-rainbow-delimiters-depth-5">(</span>not keyword<span class="org-rainbow-delimiters-depth-5">)</span> string<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">my/merlin-lsp--hover</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Call lsp-hover only in valid hover positions."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-3">(</span>my/merlin-lsp--valid-type-position-p <span class="org-rainbow-delimiters-depth-4">(</span>point<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
      <span class="org-rainbow-delimiters-depth-3">(</span>lsp-hover<span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>lsp-ui-doc-hide<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">my/merlin-lsp--document-highlight</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Call lsp-document-highlight only in valid hover positions."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-3">(</span>my/merlin-lsp--valid-type-position-p <span class="org-rainbow-delimiters-depth-4">(</span>point<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>lsp-document-highlight<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">my/merlin-lsp--setup-eldoc</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Replace default `</span><span class="org-doc"><span class="org-constant">lsp-eldoc-hook</span></span><span class="org-doc">' with custom functions checking</span>
<span class="org-doc">the validity of the position."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq-local</span> lsp-eldoc-hook
              '<span class="org-rainbow-delimiters-depth-3">(</span>my/merlin-lsp--hover my/merlin-lsp--document-highlight<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">my/merlin-lsp-register</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Register a lsp server for OCaml. This functions must be called</span>
<span class="org-doc">only after lsp-mode has been loaded."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>lsp-register-client
   <span class="org-rainbow-delimiters-depth-3">(</span>make-lsp-client
    <span class="org-builtin">:new-connection</span> <span class="org-rainbow-delimiters-depth-4">(</span>lsp-stdio-connection
                     '<span class="org-rainbow-delimiters-depth-5">(</span><span class="org-string">"opam"</span> <span class="org-string">"exec"</span> <span class="org-string">"--"</span> <span class="org-string">"ocamlmerlin-lsp"</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
    <span class="org-builtin">:major-modes</span> '<span class="org-rainbow-delimiters-depth-4">(</span>caml-mode tuareg-mode reason-mode<span class="org-rainbow-delimiters-depth-4">)</span>
    <span class="org-builtin">:server-id</span> 'ocamlmerlin-lsp<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">my/merlin-lsp</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Setup and start merlin-lsp."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>my/merlin-lsp--setup-eldoc<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>lsp<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">helm-lsp</span> <span class="org-builtin">:ensure</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">lsp-ui</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:custom</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>lsp-ui-doc-position 'bottom<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>lsp-ui-sideline-enable nil<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>lsp-ui-peek-peek-height 5<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">company-lsp</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:custom</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>company-lsp-cache-candidates nil<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">push</span> 'company-lsp company-backends<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">lsp-mode</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:custom</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>lsp-log-max 100000<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:config</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>my/merlin-lsp-register<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:bind</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-builtin">:map</span> lsp-ui-mode-map
              <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">[</span>remap xref-find-references<span class="org-rainbow-delimiters-depth-4">]</span> . lsp-ui-peek-find-references<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-builtin">:hook</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>tuareg-mode . my/merlin-lsp<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
<div id="postamble" class="status">
<a class="author" href="https://khady.info">Louis Roché</a> <span class="date">2019-03-04 Mon 00:00</span>
          <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="https://orgmode.org">Org</a> mode 9.2.1)</span>
</div>
</body>
</html>
